# print - Маалымат чыгарат
# input - Маалымат алат
# Коментарий(#) - Кодду иштетпейт
# Переменный - Маалымат сактайт

# name = input('Атынды жаз: ')
# print(f'Саламатсызбы {name}! Таанышканыма кубанычтамын😊')
# age = input('Жашынды жаз: ')
# print(f'{name}, сиздин жашыныз {age}')


# Python 8 основной тип данных
# Изменяемый
#
# Неизменямый
# int - 1, 5, 2, 6, -2, -6, -1, 4
# float - 2.1, 0.4, 8.34, 4.0, -5.2
# str - 'python', 'apple', 'Asan', '4', '43.65',
# bool - True, False

# Арифметические операции: +, -, *, /, //, %, **
print(15434343+25532345)
# 40966688
print(343-43)
# 300
print(5*3)
# 15
print(15/3)
# 5.0
print(15//3)
# 5
print(15%3)
# 0

print(5/2)
# 2.5
print(5//2)
# 2
print(5%2)
# 1
print(2**4)
# 16
print(round(25.99961653, 3))
# 26
















































